PANDAS

In [236]:
import numpy as np
import pandas as pd

1)Series

In [237]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}
s1=pd.Series(data=my_data)
print(s1)
s2=pd.Series(data=my_data,index=labels)#No need to put data= or index=
print(s2)
s3=pd.Series(my_data,labels)
print(s3)
# Pandas are better than numpy as numpy work with only numbers but pandas is very flexible

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    30
dtype: int64
a    10
b    20
c    30
dtype: int64

In [238]:
s4=pd.Series(d)
print(s4) # In case of dictionary we need to input only the dictionary variablec

a    10
b    20
c    30
dtype: int64

In [239]:
ser1=pd.Series([1,2,3,4],['USA','Germany','Japan','USSR'])
print(ser1)
print(ser1['Japan'])
ser2=pd.Series([1,2,5,4],['USA','UK','Italy','USSR'])
print(ser1+ser2)#Where the index are same like USA and Ussr,it'll add up
                #and for others where index are differnent at same location,it'll shoe Nan(NOT A NUMBER)

USA        1
Germany    2
Japan      3
USSR       4
dtype: int64
3
Germany    NaN
Italy      NaN
Japan      NaN
UK         NaN
USA        2.0
USSR       8.0
dtype: float64

2)DataFrames A

In [240]:
from numpy.random import randn 
np.random.seed(101)
#In DataFrame, we can input data,row index,column index... 
#In Series, we can input data,row index only
#if we miss row index or column index, then automatically indexing starts from 0 like in df2
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) 
print(df)
df2=pd.DataFrame(randn(5,4),['A','B','C','D','E'])
print(df2)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          0         1         2         3
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [241]:
print(df[['W','Z']].transpose())
print(type(df['W']))

          A         B         C         D         E
W  2.706850  0.651118 -2.018168  0.188695  0.190794
Z  0.503826  0.605965 -0.589001  0.955057  0.683509
<class 'pandas.core.series.Series'>

In [242]:
df['new']=df['W']+df['Y']#if we want to add a new column
print(df.drop('new',axis=1))#drop is to remove the column
print(df)#We can see that the drop wasn't permanent so we'll use inplace=True
print(df.drop('new',axis=1,inplace=True))
print(df)#We can see that the 'new' column is permanently removed
print(df.drop('E',axis=0))

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762
None
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [243]:
#Selecting rows
print(df.loc['A']) #Method 1(using label)
print(df.iloc[0]) #Method 2(using index)
print(df.loc['B','Y'])
print(df.loc['B']['Y'])
print(df.loc[['A','B'],['X','Y']])

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64
W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64
-0.8480769834036315
-0.8480769834036315
          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

3)DataFrames B

In [244]:
from numpy.random import randn 
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
print(df>0)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [245]:
booldf=df>0

In [246]:
print(df[booldf])
print(df[df>0])
print(df[df['W']>0])#We can see row C is removed because it's element in 'W' column was negative
print(df[df['W']>0]['X'])
print(df[df['W']>0][['Y','X']])
print(df[(df['W']>0) & (df['Y']>1)]) #Use bitwise operator for 'and' or 'or' statements

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64
          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757
          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [247]:
from numpy.random import randn 
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [248]:
print(df.reset_index())

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [249]:
newind='PU MP OR HP JMU'.split()
df['States']=newind

In [250]:
print(df)

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     PU
B  0.651118 -0.319318 -0.848077  0.605965     MP
C -2.018168  0.740122  0.528813 -0.589001     OR
D  0.188695 -0.758872 -0.933237  0.955057     HP
E  0.190794  1.978757  2.605967  0.683509    JMU

In [251]:
print(df.set_index('States',inplace=True))

None

In [252]:
print(df)

               W         X         Y         Z
States
PU      2.706850  0.628133  0.907969  0.503826
MP      0.651118 -0.319318 -0.848077  0.605965
OR     -2.018168  0.740122  0.528813 -0.589001
HP      0.188695 -0.758872 -0.933237  0.955057
JMU     0.190794  1.978757  2.605967  0.683509

4)DataFrames C

In [253]:
from numpy.random import randn

In [254]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [255]:
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [256]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
print(df)

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [257]:
df.index.names=['Groups','Num']
print(df)

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [258]:
print(df.loc['G2'].loc[2][['B','A']])

B    0.072960
A    0.807706
Name: 2, dtype: float64

In [259]:
print(df.xs('G1'))

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [260]:
print(df.xs(1,level='Num'))

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

5)Missing Data

In [261]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)

In [262]:
print(df)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [263]:
print(df.dropna(axis=0))

     A    B  C
0  1.0  5.0  1

In [264]:
print(df.dropna(axis=1)) #drop rows or columns with NaN

   C
0  1
1  2
2  3

In [265]:
print(df.dropna(thresh=2))#min no of Nan should be 2 before dropping

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [266]:
print(df.fillna(value='FillVALUE'))

           A          B  C
0        1.0        5.0  1
1        2.0  FillVALUE  2
2  FillVALUE  FillVALUE  3

In [267]:
print(df['A'].fillna(df['A'].mean()))

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

6)Groupby

In [268]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]} 
df=pd.DataFrame(data)

In [269]:
print(df)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [270]:
byComp=df.groupby('Company')
print(byComp) #Will return memory location
print(byComp.sum())
#print(byComp.std()) #SOMETHING IS WRNG AS STRINGS 
                     #ARE ALSO BEING USED IN FUNCTION

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000256FF4C6090>
             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [271]:
df=df.groupby('Company').describe()
print(df)
print(df.transpose())

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

7)Merging,Joining and Concatenating

In [272]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3]) 
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [273]:
dfa=pd.concat([df1,df2,df3],axis=0)
dfb=pd.concat([df1,df2,df3],axis=1)

In [274]:
print(dfa)
print(dfb)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [275]:
# Merging
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [276]:
#inner = contains the rows with matching index only
#outer = contains all the rows whether they have matching index or not

print(pd.merge(left,right,how='inner',on='key'))
print(pd.concat([left,right],axis=1))
print(pd.merge(left,right,how='outer',on='key'))

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K4  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C1   D1

In [277]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [278]:
print(pd.merge(left, right, how='outer', on=['key1', 'key2']))

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [279]:
# JOINING
# Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames
# into a single result DataFrame.
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [280]:
print(left.join(right))

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [281]:
print(left.join(right,how='outer'))

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

8)Operations

In [282]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [283]:
df['col2'].unique()

array([444, 555, 666])

In [284]:
print(len(df['col2'].unique()))
# Both are same method
print(df['col2'].nunique())

3
3

In [285]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [286]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [287]:
df[(df['col1']>2) & (df['col2']>444)]

   col1  col2 col3
2     3   666  ghi

In [288]:
df['col1'].sum()

np.int64(10)

In [289]:
def times2(x):
    return x*2

In [290]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [291]:
df['col2'].apply(lambda x:x*2) #By this way we can multiply without making functions like above

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [292]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [293]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [294]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [295]:
df.drop('col2',axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [296]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [297]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [298]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [299]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [300]:
df.isnull() #check if a number is null

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [301]:
df=pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                 'B':['one','one','two','two','one','one'],
                 'C':['x','y','x','y','x','y'],
                 'D':[1,3,2,5,4,1]})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [302]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

9)Data INput /Output

In [303]:
import pandas as pd

In [304]:
pwd #tells location of notebook

'd:\\Data Science and Machine Learning\\Udemy'

CSV Files

In [305]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [306]:
df=pd.read_csv('example')

In [307]:
df.to_csv('My_output')

In [308]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [309]:
df.to_csv('My_output',index=False)

In [310]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Excel

In [323]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [312]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

HTML

In [313]:
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/index.html')

In [314]:
type(data)

list

In [315]:
data[0] #The very first item is usually what we are looking for

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [316]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

SQL

In [317]:
from sqlalchemy import create_engine

In [318]:
engine=create_engine('sqlite:///:memory:')

In [319]:
df.to_sql('my_table',engine)

4

In [320]:
sqldf=pd.read_sql('my_table',con=engine)

In [321]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15